print ("привет, приветствую вас на игре 'Победи миллион'!")
questions = [
    "Кто открыл электричество?",
    "Кто был первым президентом Америки",
    "Кто создал игру FNAF"
]


answers = [
    ["Бенджамин Франклин", "Томас Эдисон", "Никола Тесла", "Альберт Эйнштейн"],
    ["Дональд Трамп", "Джордж Вашингтон", "Пейтон Рэндольф", "Джефферсон Дэвис"],
    ["Кейчиро Тояма", "Хидео Кодзима", "Синдзи Миками", "Скот Коутон"]
]

right_answers = [
    "1",
    "2",
    "4"
    ]

for j in range(len(questions)):
    print(questions[j])

    for i in range(len(answers[j])):
        print(f"{i+1}. {answers[j][i]}")


    user_answer = input("ведите ответ:")
    if  user_answer==right_answers[j]:
        print("Верно!")
    else:
        print("Неверно!")
 
print("Спасибо за игру!")




